IOsonata/IOsonata/ARM/ST/STM32L4xx/STM32L4S9/exemples/SPIMasterSlave/src/board.h
/**-------------------------------------------------------------------------
@example	board.h

@brief	Board specific definitions

This file contains all I/O definitions for a specific board for the
application firmware.  This files should be located in each project and
modified to suit the need for the application use case.

@author	Hoang Nguyen Hoan
@date	July 26, 2019

@license

Copyright (c) 2019, I-SYST inc., all rights reserved

Permission to use, copy, modify, and distribute this software for any purpose
with or without fee is hereby granted, provided that the above copyright
notice and this permission notice appear in all copies, and none of the
names : I-SYST or its contributors may be used to endorse or
promote products derived from this software without specific prior written
permission.

For info or contributing contact : hnhoan at i-syst dot com

THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND ANY
EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE FOR ANY
DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

----------------------------------------------------------------------------*/

#ifndef __BOARD_H__
#define __BOARD_H__

#include "stm32l4xx.h"

// *** STM32L476G-DISCO
#define UART_DEVNO			1
#define UART_RX_PORT		IOPORTD//3
#define UART_RX_PIN			6
#define UART_RX_PINOP		IOPINOP_FUNC7//(0x72)

#define UART_TX_PORT		IOPORTD//3
#define UART_TX_PIN			5
#define UART_TX_PINOP		IOPINOP_FUNC7//(0x72)

#define UART_CTS_PORT		-1
#define UART_CTS_PIN		-1
#define UART_CTS_PINOP		0
#define UART_RTS_PORT		-1
#define UART_RTS_PIN		-1
#define UART_RTS_PINOP		0

#define SPI_MASTER_DEVNO		2
#define SPI_MASTER_SCK_PORT		IOPORTB//1
#define SPI_MASTER_SCK_PIN		3
#define SPI_MASTER_SCK_PINOP	IOPINOP_FUNC6//0x62
#define SPI_MASTER_MISO_PORT	IOPORTB//1
#define SPI_MASTER_MISO_PIN		4
#define SPI_MASTER_MISO_PINOP	IOPINOP_FUNC6//0x62
#define SPI_MASTER_MOSI_PORT	IOPORTC//2
#define SPI_MASTER_MOSI_PIN		12
#define SPI_MASTER_MOSI_PINOP	IOPINOP_FUNC6//0x62

#define SPI_MASTER_CS_PORT		IOPORTA//0
#define SPI_MASTER_CS_PIN		15
#define SPI_MASTER_CS_PINOP		IOPINOP_FUNC6//0x62

#define SPI_SLAVE_DEVNO			1
#define SPI_SLAVE_SCK_PORT		IOPORTB//1
#define SPI_SLAVE_SCK_PIN		10
#define SPI_SLAVE_SCK_PINOP		IOPINOP_FUNC5//0x52
#define SPI_SLAVE_MISO_PORT		IOPORTD//3
#define SPI_SLAVE_MISO_PIN		3
#define SPI_SLAVE_MISO_PINOP	IOPINOP_FUNC5//0x52
#define SPI_SLAVE_MOSI_PORT		IOPORTB//1
#define SPI_SLAVE_MOSI_PIN		15
#define SPI_SLAVE_MOSI_PINOP	IOPINOP_FUNC5//0x52

#define SPI_SLAVE_CS_PORT		IOPORTB//1
#define SPI_SLAVE_CS_PIN		9
#define SPI_SLAVE_CS_PINOP		IOPINOP_FUNC5//0x52
/*
#define SPI0_DEVNO			0
#define SPI0_MISO_PORT		0
#define SPI0_MISO_PIN        			15//13
#define SPI0_MISO_PINOP      			1
#define SPI0_MOSI_PORT       			0
#define SPI0_MOSI_PIN        			16//12
#define SPI0_MOSI_PINOP      			1
#define SPI0_SCK_PORT        			0
#define SPI0_SCK_PIN         			17//11
#define SPI0_SCK_PINOP       			1
*/

#endif // __BOARD_H__

